EDTMKERPNEW.Разработка/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

EDTMKERPNEW.Разработка/src/InformationRegisters/Разр_ЯрлыкиКоробов/Разр_ЯрлыкиКоробов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Разр_ЯрлыкиКоробов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Напечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПереданПереработчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Стерилизован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перемещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пересчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Упакован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Передвинут</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ПересчетТоваров</types>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.УпаковочныйЛист</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTMKERPNEW.Разработка/src/Documents/ЭтапПроизводства2_2/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Разр_Разр_СоздатьЯрлыкиКоробовПосле(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Сообщить("Сначала запишите документ.");
        Возврат;
    КонецЕсли;

    ТекущаяСтрока = Элементы.ВыходныеИзделия.ТекущиеДанные;

    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите строку в табличной части ВыходныеИзделия.");
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
        Сообщить("В текущей строке не заполнена номенклатура.");
        Возврат;
    КонецЕсли;

    ДопПараметры = Новый Структура;
    ДопПараметры.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
    ДопПараметры.Вставить("НомерСтроки", ТекущаяСтрока.НомерСтроки);	

    Оповещение = Новый ОписаниеОповещения(
        "Разр_ПослеВводаКоличестваКоробов",
        ЭтотОбъект,
        ДопПараметры
    );

    ПоказатьВводЧисла(
        Оповещение,
        0,
        "Введите количество коробов",
        10,
        0
    );

КонецПроцедуры

&НаКлиенте
Процедура Разр_ПослеВводаКоличестваКоробов(Количество, ДополнительныеПараметры) Экспорт

    Если Количество = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если Количество <= 0 Тогда
        Сообщить("Количество должно быть больше нуля.");
        Возврат;
    КонецЕсли;

    Если Количество <> Цел(Количество) Тогда
        Сообщить("Введите целое число.");
        Возврат;
    КонецЕсли;

    Создано = Разр_СоздатьЗаписиЯрлыковНаСервере(
        ДополнительныеПараметры.Номенклатура,
        ДополнительныеПараметры.НомерСтроки,
        Количество
    );

    Сообщить("Создано ярлыков коробов: " + Создано);

КонецПроцедуры 

&НаСервере
Функция Разр_СоздатьЗаписиЯрлыковНаСервере(Номенклатура, НомерСтроки, Количество)

    ЭтапПроизводства = Объект.Ссылка;

    ДанныеШтрихкода = Разр_ПолучитьОснованиеШтрихкода(
        ЭтапПроизводства,
        Номенклатура,
        НомерСтроки
    );

    Если ДанныеШтрихкода = Неопределено Тогда
        ВызватьИсключение "Не удалось получить данные для штрихкода по текущей строке.";
    КонецЕсли;

    Серия = ДанныеШтрихкода.Серия;
    ОснованиеШтрихкода = ДанныеШтрихкода.ОснованиеШтрихкода;

    Если НЕ ЗначениеЗаполнено(Серия) Тогда
        ВызватьИсключение "Для текущей строки не найдена серия.";
    КонецЕсли;

    Если ПустаяСтрока(ОснованиеШтрихкода) Тогда
        ВызватьИсключение "Не удалось сформировать основание штрихкода.";
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	МАКСИМУМ(Ярлыки.Номер) КАК ПоследнийНомер
    |ИЗ
    |	РегистрСведений.Разр_ЯрлыкиКоробов КАК Ярлыки
    |ГДЕ
    |	Ярлыки.Номенклатура = &Номенклатура
    |	И Ярлыки.Серия = &Серия";

    //Запрос.УстановитьПараметр("ЭтапПроизводства", ЭтапПроизводства);
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Серия", Серия);

    Выборка = Запрос.Выполнить().Выбрать();

    ПоследнийНомер = 0;

    Если Выборка.Следующий() Тогда
        Если Выборка.ПоследнийНомер <> Null Тогда
            ПоследнийНомер = Выборка.ПоследнийНомер;
        КонецЕсли;
    КонецЕсли;

    НаборЗаписей = РегистрыСведений.Разр_ЯрлыкиКоробов.СоздатьНаборЗаписей();

    Для Счетчик = 1 По Количество Цикл

        НовыйНомер = ПоследнийНомер + Счетчик;

        НоваяЗапись = НаборЗаписей.Добавить();

        НоваяЗапись.Номенклатура = Номенклатура;
        НоваяЗапись.ЭтапПроизводства = ЭтапПроизводства;
        НоваяЗапись.Серия = Серия;
        НоваяЗапись.Номер = НовыйНомер;
		НоваяЗапись.Автор = ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.ДокументДвижения = ЭтапПроизводства;

        НоваяЗапись.Штрихкод = ОснованиеШтрихкода + Формат(НовыйНомер, "ЧГ=0");

    КонецЦикла;

    НаборЗаписей.Записать(Ложь);

    Возврат Количество;

КонецФункции

&НаСервере
Функция Разр_ПолучитьОснованиеШтрихкода(Ссылка, Номенклатура, НомерСтроки)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Серия КАК Серия,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Номенклатура.Код + ""-"" + ПОДСТРОКА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Серия.Наименование, 4, 2) + ПОДСТРОКА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Серия.Наименование, 7, 2) + ПОДСТРОКА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Серия.Наименование, 10, 2) + ПОДСТРОКА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Серия.Наименование, 16, 2) + ПОДСТРОКА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Серия.Наименование, 19, 2) + ПОДСТРОКА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Серия.Наименование, 22, 2) + ""-"" КАК ОснованиеШтрихкода,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Артикул КАК Артикул,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка.Вес КАК Вес,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка.Числитель КАК Упаковок,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение.ДатаПотребности КАК ДатаПроизводства,
	|	ДОБАВИТЬКДАТЕ(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение.ДатаПотребности, ГОД, ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.СрокГодности) КАК ГоденДо,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК ХарактеристикаВыход,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК ХарактеристикаВход
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии
	|		ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ЭтапПроизводства2_2ВыходныеИзделияСерии.Ссылка
	|			И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ЭтапПроизводства2_2ВыходныеИзделияСерии.Номенклатура
	|			И ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки = ЭтапПроизводства2_2ВыходныеИзделияСерии.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	|			И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Ссылка
	|	И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура
	|	И ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки = &НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ1.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ1.ХарактеристикаВыход.Наименование = ""На стерилизацию""
	|				ИЛИ ВТ1.Номенклатура.ВидНоменклатуры.Наименование = ""Продукция нестерильная""
	|			ТОГДА ВТ1.Серия
	|		ИНАЧЕ СерииНоменклатуры.Ссылка
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА ВТ1.ХарактеристикаВыход.Наименование = ""На стерилизацию""
	|				ИЛИ ВТ1.Номенклатура.ВидНоменклатуры.Наименование = ""Продукция нестерильная""
	|			ТОГДА ВТ1.ОснованиеШтрихкода
	|		ИНАЧЕ ВТ1.Номенклатура.Код + ""-"" + ПОДСТРОКА(СерииНоменклатуры.Наименование, 4, 2) + ПОДСТРОКА(СерииНоменклатуры.Наименование, 7, 2) + ПОДСТРОКА(СерииНоменклатуры.Наименование, 10, 2) + ПОДСТРОКА(СерииНоменклатуры.Наименование, 16, 2) + ПОДСТРОКА(СерииНоменклатуры.Наименование, 19, 2) + ПОДСТРОКА(СерииНоменклатуры.Наименование, 22, 2) + ""-""
	|	КОНЕЦ КАК ОснованиеШтрихкода,
	|	ВТ1.Артикул КАК Артикул,
	|	ВТ1.Вес КАК Вес,
	|	ВТ1.Упаковок КАК Упаковок,
	|	ВТ1.ДатаПроизводства КАК ДатаПроизводства,
	|	ВТ1.ГоденДо КАК ГоденДо,
	|	ВТ1.НоменклатураВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	ВТ1.ХарактеристикаВыход КАК ХарактеристикаВыход,
	|	ВТ1.ХарактеристикаВход КАК ХарактеристикаВход,
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ВТ1.ДатаПроизводства = СерииНоменклатуры.ДатаПроизводства
	|			И ВТ1.ГоденДо = СерииНоменклатуры.ГоденДо
	|			И ВТ1.НоменклатураВидНоменклатуры = СерииНоменклатуры.ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("Номенклатура", Выборка.Номенклатура);
	Данные.Вставить("Артикул", Выборка.Артикул);
	Данные.Вставить("Упаковок", Выборка.Упаковок);
	Данные.Вставить("Вес", Выборка.Вес);
	Данные.Вставить("Серия", Выборка.Серия);
	Данные.Вставить("ОснованиеШтрихкода", Выборка.ОснованиеШтрихкода);
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура Разр_Разр_ПечатьЯрлыковКоробовПосле(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Сообщить("Сначала запишите документ.");
        Возврат;
    КонецЕсли;

    ТекущаяСтрока = Элементы.ВыходныеИзделия.ТекущиеДанные;

    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите строку в табличной части ВыходныеИзделия.");
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
        Сообщить("В текущей строке не заполнена номенклатура.");
        Возврат;
    КонецЕсли;

    ДанныеПечати = Разр_СформироватьЯрлыкиКоробовНаСервере(
        ТекущаяСтрока.Номенклатура,
		ТекущаяСтрока.Упаковка,
        ТекущаяСтрока.НомерСтроки
    );

    Если ДанныеПечати = Неопределено Тогда
        Сообщить("Нет ненапечатанных ярлыков по текущей строке.");
        Возврат;
    КонецЕсли;

    ДанныеПечати.ТабличныйДокумент.Показать("Ярлыки коробов");
КонецПроцедуры 

&НаСервере
Функция Разр_СформироватьЯрлыкиКоробовНаСервере(Номенклатура, Упаковка, НомерСтроки)

    ЭтапПроизводства = Объект.Ссылка;

    // 1. Получаем серию текущей строки

    ДанныеСтроки = Разр_ПолучитьОснованиеШтрихкода(
        ЭтапПроизводства,
        Номенклатура,		
        НомерСтроки
    );

    Если ДанныеСтроки = Неопределено Тогда
        ВызватьИсключение "Не удалось получить серию текущей строки.";
    КонецЕсли;

    Серия = ДанныеСтроки.Серия;

    Если НЕ ЗначениеЗаполнено(Серия) Тогда
        ВызватьИсключение "Для текущей строки не найдена серия.";
    КонецЕсли;

    // 2. Получаем ненапечатанные ярлыки из РС

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	Ярлыки.Номенклатура КАК Номенклатура,
    |	Ярлыки.ЭтапПроизводства КАК ЭтапПроизводства,
    |	Ярлыки.Серия КАК Серия,
    |	Ярлыки.Номер КАК Номер,
    |	Ярлыки.Штрихкод КАК Штрихкод,
    |	Ярлыки.Номенклатура.Артикул КАК Артикул,
    |	ИСТИНА КАК Напечатан,
    |	Ярлыки.Автор КАК Автор
    |ИЗ
    |	РегистрСведений.Разр_ЯрлыкиКоробов КАК Ярлыки
    |ГДЕ
    |	Ярлыки.ЭтапПроизводства = &ЭтапПроизводства
    |	И Ярлыки.Номенклатура = &Номенклатура
    |	И Ярлыки.Серия = &Серия
    |	И Ярлыки.Напечатан = ЛОЖЬ
    |
    |УПОРЯДОЧИТЬ ПО
    |	Ярлыки.Номер";

    Запрос.УстановитьПараметр("ЭтапПроизводства", ЭтапПроизводства);
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Серия", Серия);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Если НЕ Выборка.Следующий() Тогда
        Возврат Неопределено;
    КонецЕсли;

    // 3. Формируем табличный документ

    ТабДок = Новый ТабличныйДокумент;
    ТабДок.АвтоМасштаб = Истина;
    ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

    Макет = Документы.ЭтапПроизводства2_2.ПолучитьМакет("Разр_ЯрлыкКороба58x30");
    

    НомераКПечати = Новый Массив;
    Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
        ОбластьЯрлык = Макет.ПолучитьОбласть("Область1");
		
        ОбластьЯрлык.Параметры.Артикул = Выборка.Артикул;
        
        ОбластьЯрлык.Параметры.Упаковок = Упаковка.Числитель;

        ОбластьЯрлык.Параметры.Вес = Упаковка.Вес;            

        // Строка для DataMatrix.
        // В макете можно использовать объект штрихкода DataMatrix
        // либо картинку, сформированную отдельной функцией.
        КартинкаDataMatrix = Разр_ПолучитьКартинкуDataMatrix(Выборка.Штрихкод);
		
		ОбластьЯрлык.Рисунки.Штрихкод.Картинка = КартинкаDataMatrix;

        ТабДок.Вывести(ОбластьЯрлык);		

        НомераКПечати.Добавить(Выборка.Номер);

        
        // Если каждый ярлык должен быть на отдельной этикетке
        ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		МенеджерЗаписи = РегистрыСведений.Разр_ЯрлыкиКоробов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДокументДвижения = ЭтапПроизводства;
		МенеджерЗаписи.Записать();

    КонецЦикла;

    ДанныеПечати = Новый Структура;
    ДанныеПечати.Вставить("ТабличныйДокумент", ТабДок);
    ДанныеПечати.Вставить("Номенклатура", Номенклатура);
    ДанныеПечати.Вставить("Серия", Серия);
    ДанныеПечати.Вставить("Номера", НомераКПечати);

    Возврат ДанныеПечати;

КонецФункции

&НаСервере
Функция Разр_ПолучитьКартинкуDataMatrix(ЗначениеШтрихкода)

    ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();

    // Размер картинки DataMatrix.
    // Для ярлыка 58x30 мм слева обычно достаточно 120-180.
    ПараметрыШтрихкода.Ширина = 140;
    ПараметрыШтрихкода.Высота = 140;

    // 18 - Datamatrix ASCII.
    // 24 - Datamatrix GS1ASCII, если когда-нибудь понадобится GS1/маркировка.
    ПараметрыШтрихкода.ТипКода = 24;

    ПараметрыШтрихкода.Штрихкод = ЗначениеШтрихкода;
    ПараметрыШтрихкода.ТипВходныхДанных = 0; // 0 - строка

    // Текст под DataMatrix нам не нужен.
    ПараметрыШтрихкода.ОтображатьТекст = Ложь;

    // Для печати лучше обычный белый фон, не прозрачный.
    ПараметрыШтрихкода.ПрозрачныйФон = Ложь;

    ПараметрыШтрихкода.Инвертирован = Ложь;
    ПараметрыШтрихкода.УголПоворота = 0;

    // Можно оставить Ложь, как в типовой функции.
    // Если картинка будет маленькая/обрезанная — потом попробуем Истина.
    ПараметрыШтрихкода.Масштабировать = Ложь;
    ПараметрыШтрихкода.СохранятьПропорции = Истина;

    // Лучше не убирать лишний фон сразу, чтобы не потерять тихую зону вокруг кода.
    ПараметрыШтрихкода.УбратьЛишнийФон = Ложь;

    Результат = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);

    Если НЕ Результат.Результат Тогда
        ВызватьИсключение "Не удалось сформировать DataMatrix для значения: " + ЗначениеШтрихкода;
    КонецЕсли;

    Возврат Результат.Картинка;

КонецФункции
